
siamese_net summary:
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 2048, 2)]    0
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 2048, 2)]    0
__________________________________________________________________________________________________
sequential (Sequential)         (None, 100)          22440       input_1[0][0]
                                                                 input_2[0][0]
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 100)          0           sequential[0][0]
                                                                 sequential[1][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 100)          0           lambda[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            101         dropout[0][0]
==================================================================================================
Total params: 22,541
Trainable params: 22,541
Non-trainable params: 0
__________________________________________________________________________________________________

sequential_3 is WDCNN:
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
separable_conv1d (SeparableC (None, 256, 14)           4538
_________________________________________________________________
max_pooling1d (MaxPooling1D) (None, 85, 14)            0
_________________________________________________________________
separable_conv1d_1 (Separabl (None, 85, 32)            522
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 28, 32)            0
_________________________________________________________________
separable_conv1d_2 (Separabl (None, 28, 64)            2176
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 9, 64)             0
_________________________________________________________________
separable_conv1d_3 (Separabl (None, 9, 64)             4352
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 4, 64)             0
_________________________________________________________________
separable_conv1d_4 (Separabl (None, 2, 64)             4352
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 1, 64)             0
_________________________________________________________________
flatten (Flatten)            (None, 64)                0
_________________________________________________________________
dense (Dense)                (None, 100)               6500
=================================================================
Total params: 22,440
Trainable params: 22,440
Non-trainable params: 0
_________________________________________________________________
72006

wdcnn_net summary:
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_3 (InputLayer)         [(None, 2048, 2)]         0
_________________________________________________________________
sequential_1 (Sequential)    (None, 100)               70996
_________________________________________________________________
dropout_1 (Dropout)          (None, 100)               0
_________________________________________________________________
dense_3 (Dense)              (None, 10)                1010
=================================================================
Total params: 72,006
Trainable params: 72,006
Non-trainable params: 0
_________________________________________________________________
300
random seed: 0